Backend/app/Controllers/AuthController.php

    public function login()
    {
        $data = $this->request->getJSON(true);

        // Validasi input
        if (!$data || !isset($data['email'], $data['password'])) {
            return $this->failValidationErrors('Email dan password wajib diisi');
        }

        // Ambil user berdasarkan email
        $user = $this->userModel->where('email', $data['email'])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'distributor2@gmail.com'
 LIMIT 1