Backend/app/Controllers/OrderController.php

SELECT *
FROM `orders`
ORDER BY `id` DESC
---
    public function __construct()
    {
        $this->orderItemModel = new OrderItemModel();

SELECT *
FROM `orders`
WHERE `distributor_id` = '2'
ORDER BY `id` DESC
---
    public function index()
    {
        // 🔐 Ambil user dari token
        $authHeader = $this->request->getHeaderLine('Authorization');
        if (!$authHeader || !preg_match('/Bearer\s(\S+)/', $authHeader, $matches)) {
            return $this->failUnauthorized('Token tidak ditemukan.');
        }

        $token = $matches[1];
        $secretKey = getenv('JWT_SECRET') ?: 'default_key';

        try {
            $decoded = JWT::decode($token, new Key($secretKey, 'HS256'));
            $userId = $decoded->data->id;
            $userRole = $decoded->data->role;
        } catch (\Exception $e) {
            return $this->failUnauthorized('Token tidak valid');
        }

        // 🔍 Filter berdasarkan role
        $builder = $this->model->orderBy('id', 'DESC');

        if ($userRole === 'agen') {
            $builder->where('agen_id', $userId);
        } elseif ($userRole === 'distributor') {
            $builder->where('distributor_id', $userId);
        } elseif ($userRole === 'pabrik') {
            $builder->where('pabrik_id', $userId);
        }

        $orders = $builder->findAll();

SELECT *
FROM `order_items`
WHERE `order_id` IN ('5','2','1')
---

        // Ambil semua item untuk order yang ada
        $orderIds = array_column($orders, 'id');
        $items = $this->orderItemModel
            ->whereIn('order_id', $orderIds)
            ->findAll();

SELECT *
FROM `users`
WHERE `id` IN (3,2,1)
---
        $userMap = [];
        if (!empty($userIds)) {
            $userModel = new UserModel();
            $users = $userModel->whereIn('id', array_unique($userIds))->findAll();

SELECT *
FROM `order_items`
WHERE `order_id` = '8'
SELECT *
FROM `users`
WHERE `users`.`id` = '5'
SELECT *
FROM `users`
WHERE `users`.`id` = '4'
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function show($idOrCode = null)
    {
        if (!$idOrCode) {
            return $this->failValidationErrors('ID / order_code diperlukan');
        }

        // cari berdasarkan ID numerik atau order_code string
        if (ctype_digit((string) $idOrCode)) {
            $order = $this->model->find((int) $idOrCode);
        } else {
            $order = $this->model->where('order_code', $idOrCode)->first();
        }

        if (!$order) {
            return $this->failNotFound('Order tidak ditemukan');
        }

        // ambil detail item
        $order['items'] = $this->orderItemModel
            ->where('order_id', $order['id'])
            ->findAll();

        $userModel = new UserModel();

        // ambil nama agen & distributor
        $agen = $userModel->find($order['agen_id']);
        $distributor = $userModel->find($order['distributor_id']);

        // ambil nama pabrik
        $pabrik = $userModel->find($order['pabrik_id']);