Backend/app/Controllers/OrderController.php

    public function __construct()
    {
        $this->orderItemModel = new OrderItemModel();
---
SELECT *
FROM `order_items`
WHERE `order_id` IN ('3','2','1')