Backend/app/Controllers/UserController.php

    public function index()
    {
        $role = $this->request->getGet('role');

        $builder = $this->userModel->select([
            'id',
            'name',
            'email',
            'role',
            'no_telp',
            'alamat',
            'nama_rekening',
            'rekening',
            'nama_bank',
            'is_active',
            'created_at',
        ]);
---
SELECT `id`, `name`, `email`, `role`, `no_telp`, `alamat`, `nama_rekening`, `rekening`, `nama_bank`, `created_at`
FROM `users`
WHERE `role` = 'agen'